{
  "messages": [
    {
      "linkedinURL": "https://www.linkedin.com/in/ACwAACNYylEBZJnQY9BWGeJky936DIdGkcIdqSM",
      "coldMessage": "Hi Peilin,\n\nMy name is John Smith, a senior at USC studying [mention John's major if known, otherwise remove]. I noticed you also attended USC for your Master's in Computer Science – Fight On! I'm deeply interested in software engineering, particularly at Google, and I'm exploring internship opportunities. Would you be open to a brief 15-minute chat about your experience at Google and any advice you might have for someone looking to break into the field?\n\nThanks for your time and consideration.\n\nBest,\n\nJohn Smith\n",
      "profileName": "Peilin Zhou",
      "headline": "Software Engineer at Google"
    },
    {
      "linkedinURL": "https://www.linkedin.com/in/ACwAAAqq3AkBfctkGZFg0gDsn9lj2kKEK7tr0W8",
      "coldMessage": "Hi Travis,\n\nAs a fellow Trojan and current senior at USC involved in Robotics Club and AI Society, I came across your profile and was impressed by your work as a Software Engineer at Google. I'm also based in Los Angeles, and with graduation approaching, I'm actively seeking internship opportunities in software engineering at Google. Would you be open to a brief 15-minute chat sometime in the next week to discuss your experiences at Google and any advice you might have for someone looking to break in? Thanks for your time and consideration.\n\nBest,\n\nJohn Smith\n",
      "profileName": "Travis Yoshimoto",
      "headline": "Software Engineer at Google"
    },
    {
      "linkedinURL": "https://www.linkedin.com/in/ACwAAAnnggABGqIMnNeUxostEyHNK1hS1W9ZHfo",
      "coldMessage": "Hi Thomas,\n\nI hope this message finds you well. I'm John Smith, a senior at USC, deeply involved in Robotics Club and AI Society. As a fellow Trojan and aspiring software engineer, I was excited to see you're at Google in LA and a USC alum! I'm currently exploring internship opportunities in software engineering for next summer and would love to learn more about your experience at Google. Would you be open to a brief 15-minute call sometime in the next few weeks?\n\nThanks for your time and consideration.\nBest regards,\nJohn Smith\n",
      "profileName": "Thomas Howard-Dolid",
      "headline": "Software Engineer at SpaceX"
    },
    {
      "linkedinURL": "https://www.linkedin.com/in/ACwAABpUUqkBcFiijSSQWlDGhVvb8UwskkXw0Ns",
      "coldMessage": "Hi Natalie,\n\nI'm John Smith, a senior at USC studying [mention John's major if known]. I saw you're also a Trojan and a Software Engineer at Google's Irvine office – impressive! I'm heavily involved with Robotics Club and the AI Society here on campus, and I'm actively exploring software engineering internship opportunities at Google for next year. Would you be open to a brief 15-minute chat sometime next week about your experience at Google and any advice you might have for a fellow Trojan?\n\nThanks so much for your time and consideration.\n\nBest,\nJohn\n",
      "profileName": "Natalie Craun",
      "headline": "Software Engineer at Google"
    },
    {
      "linkedinURL": "https://www.linkedin.com/in/ACwAABd0THoBomVAJzqmpQnrdZoymixcdUtz_QA",
      "coldMessage": "Hi Matthew,\n\nI'm John Smith, a senior at USC studying [mention John's major if known, otherwise remove]. I noticed you're a fellow Trojan working as a Software Engineer at Google's Manhattan Beach office – great to connect! As a member of the Robotics Club and AI Society, I'm really interested in software engineering internship opportunities at Google. Would you be open to a quick 15-minute chat about your experience and any advice you might have for someone looking to apply?\n\nThanks for your time and consideration.\n\nBest,\nJohn\n",
      "profileName": "Matthew Wenner",
      "headline": "Software Engineer at Google"
    }
  ],
  "timestamp": "2025-04-26T11:18:58.631Z",
  "userProfile": {
    "universityName": "USC",
    "fullName": "John Smith",
    "gradeYear": "Senior",
    "clubs": [
      "Robotics Club",
      "AI Society"
    ],
    "societies": [
      "Phi Beta Kappa",
      "Tau Beta Pi"
    ],
    "location": "Los Angeles"
  },
  "userObjective": "I want to connect with software engineers at Google for internship opportunities"
}