{
  "messages": [
    {
      "linkedinURL": "https://www.linkedin.com/in/ACwAACD8WXQBviGNgnU0AASeoHjgwpur43bd5jE",
      "coldMessage": "Hi Mugdha,\n\nI'm John Smith, a senior at USC studying [mention John's major if known, otherwise remove]. I noticed you're also a Trojan and a Software Engineer at Google – impressive! I'm deeply interested in software engineering and exploring internship opportunities at Google. Would you be open to a quick 15-minute chat sometime this week or next about your experience and any advice you might have for someone looking to follow a similar path?\n\nThanks,\nJohn\n"
    },
    {
      "linkedinURL": "https://www.linkedin.com/in/ACwAAALZH7kBDlApW3YzUakngchCmv0D_AxNWjc",
      "coldMessage": "Hi Brandon,\n\nI hope this message finds you well. My name is John Smith, and I'm a senior at USC, involved in the Robotics Club and AI Society. I noticed you're also a Trojan alum and a Software Engineer at Google – impressive! I'm currently exploring internship opportunities in software engineering and would love to learn more about your experience at Google and any advice you might have. Would you be open to a brief 15-minute chat sometime in the next few weeks?\n\nThanks for your time and consideration.\n\nBest,\n\nJohn\n"
    },
    {
      "linkedinURL": "https://www.linkedin.com/in/ACwAAAEiIPwBqFUBBfJeLh4SsVFRL_Yr8DtRc9w",
      "coldMessage": "Hi Ozgun,\n\nI'm John Smith, a senior at USC studying [mention John's major if known, otherwise remove]. I noticed you also attended USC and are now a Staff Software Engineer at Google. I'm deeply interested in software engineering and would love to learn more about your experience at Google, particularly regarding internship opportunities. Would you be open to a brief 15-minute call sometime next week?\n\nThanks so much for your time and consideration.\n\nBest,\nJohn Smith\n"
    },
    {
      "linkedinURL": "https://www.linkedin.com/in/ACwAAA_3wJMBxg_2Zg-F09ZOzMXlf3Y5if9PmOA",
      "coldMessage": "Hi Arturo,\n\nI'm John Smith, a senior at USC with a passion for software engineering. As a fellow Trojan, I noticed you also went to USC and are now at Google. I'm actively seeking internship opportunities in software engineering and would love to learn more about your experience at Google. Would you be open to a brief 15-minute chat sometime next week?\n\nThanks for your time and consideration.\n\nBest regards,\nJohn Smith\n"
    },
    {
      "linkedinURL": "https://www.linkedin.com/in/ACwAACKg_SwBLcU9lBBlyWqCtTmaf1qeiOCDqR4",
      "coldMessage": "Hi Sriram,\n\nI'm John Smith, a senior at USC also passionate about software engineering. I saw you're a fellow Trojan and a Software Developer at Google, which is fantastic! As I'm exploring internship opportunities in the field, I'd love to hear about your experience at Google and any advice you might have for someone just starting out. Would you be open to a quick 15-minute chat sometime next week?\n\nThanks,\nJohn\n"
    }
  ]
}