{
  "messages": [
    {
      "linkedinURL": "https://www.linkedin.com/in/ACwAADhDA3sBvZes647QcqNHUEMiYrDaYLTCqdw",
      "coldMessage": "Hi Ruizhao,\n\nMy name is John Smith, a senior Computer Science student at USC. I noticed you also attended USC, and I'm incredibly impressed with your work as a Software Engineer at Google. As I'm exploring internship opportunities in software engineering, particularly at Google, I'd be grateful for the chance to learn from your experience. Would you be open to a brief 15-minute chat sometime next week?\n\nThanks so much for your time and consideration.\n\nBest regards,\nJohn\n"
    },
    {
      "linkedinURL": "https://www.linkedin.com/in/ACwAABxY900Bolq5XlO8t04b9ymYf7ETLn5qY94",
      "coldMessage": "Hi Shuo,\n\nMy name is John Smith, and I'm a senior Computer Engineering student at USC. I noticed you also attended USC for your Master's, so I wanted to reach out. I'm very interested in software engineering, particularly at Google, and I'm exploring internship opportunities. Would you be open to a brief 15-minute chat about your experience at Google and any advice you might have for someone looking to break into the field? Thanks for your time and consideration!\n\nBest regards,\nJohn\n"
    },
    {
      "linkedinURL": "https://www.linkedin.com/in/ACwAAAeCuEIB5zGNLtBzB0NHiaTAndjTliAOT5I",
      "coldMessage": "Hi Punyawee,\n\nI'm John Smith, a senior Computer Science student at USC. I saw you also graduated from USC's CS program – Trojan pride! I'm really interested in software engineering, especially at Google, and I'm looking for internship opportunities for next year. Would you be open to a brief 15-minute chat about your experience at Google and any advice you might have?\n\nThanks for your time and consideration.\n\nBest,\nJohn\n"
    },
    {
      "linkedinURL": "https://www.linkedin.com/in/ACwAABYftCgB2uhp67VVV0e6nOfwXto7UXzlf8A",
      "coldMessage": "Hi Rohnak,\n\nMy name is John Smith, a senior at USC studying computer science. I noticed you're also a Trojan alum – Fight On! I'm particularly interested in software engineering and internship opportunities at Google. Given your experience as a Senior Software Development Engineer, I was hoping you might be open to a quick 15-minute chat about your career path. I'd really appreciate any insights you could offer.\n\nThanks for your time and consideration.\n\nBest regards,\n\nJohn Smith\n"
    },
    {
      "linkedinURL": "https://www.linkedin.com/in/ACwAAABCNzYBtQewSUKMZtxbUOVzyftHJ2px0yY",
      "coldMessage": "Hi Stephen,\n\nI'm John Smith, a senior at USC studying computer science, and I'm also involved with the Robotics Club and AI Society. I noticed you're also a Trojan and a Software Engineer at Google! As I'm exploring internship opportunities in software engineering for next summer, I'd be grateful for the chance to learn about your experience at Google and any advice you might have. Would you be open to a quick 15-minute chat sometime in the next few weeks?\n\nThanks so much for your time and consideration.\n\nBest,\nJohn Smith\n"
    }
  ]
}